// https://ac-as.net/how-to-get-right-most-bit/

pub fn get_right_most_bit_index(x: u64) -> u64 {
    const HASH: u64 = 0x03F566ED27179461;
    const TABLE: [u64; 64] = [
        0, 1, 59, 2, 60, 40, 54, 3, 61, 32, 49, 41, 55, 19, 35, 4, 62, 52, 30, 33, 50, 12, 14, 42,
        56, 16, 27, 20, 36, 23, 44, 5, 63, 58, 39, 53, 31, 48, 18, 34, 51, 29, 11, 13, 15, 26, 22,
        43, 57, 38, 47, 17, 28, 10, 25, 21, 37, 46, 9, 24, 45, 8, 7, 6,
    ];

    if x == 0 {
        panic!();
    }

    // 右端ビットのみ残す
    let y = x & (!x + 1);

    // yを掛けることで左シフト相応の操作をし、M系列の上位６ビットに連動するテーブル値を取り出す
    let i = (HASH * y) >> 58;
    TABLE[i as usize]
}
